/**********************************************************
 *  publicoffer.js
 *  Текст згоди
 *
 *  OpenEMR      
 *  http://www.open-emr.org
 *
 *  API EHEALTH version 1.0                          
 *  Writing by sgiman, 2020
**********************************************************/
function PublicOfferViewModel() {
    var self = this;

    self.consent = ko.observable(true);       /// change 
	self.consent_text = ko.observable("Відповідно до Закону України \"Про захист персональних даних\" з метою ведення реєстрів електронної системи охорони здоров'я та забезпечення її функціонування у дослідній експлуатації надаю згоду обраному оператору та адміністратору електронної системи охорони здоров'я на обробку моїх персональних даних з первинних джерел, а також на здійснення дій пов'язаних зі збиранням, реєстрацією, накопиченням, зберіганням, адаптуванням, зміною, поновленням, використанням, поширенням, розповсюдженням, реалізацією, передачею, знеособленням, знищенням будь-яких відомостей. Додатково надаю згоду на доступ до моїх персональних даних уповноважених третіх осіб, що визначає дії оператора МІС та адміністратора у разі отримання запиту від уповноваженої третьої особи щодо надання доступу до персональних даних. Підтверджую достовірність вказаних мною даних та добровільність надання цих даних до електронної системи охорони здоров'я, що працює у дослідній експлуатації. Усвідомлюю, що у випадку надання мною невірної інформації, мені може бути відмовлено в реєстрації в електронній системі охорони здоров'я. Зобов'язуюсь дотримуватись Регламенту функціонування електронної системи охорони здоров'я.").extend({ required: true });
} 